bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    /* Disable both comparator IEs before any mux change (Rule 2) */
#if GARUDA_TARGET_AK512
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_A);
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_B);
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_C);
#else
    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);
#endif

    /* Select active detection channel/comparator for the floating phase.
     * AK128: HAL reproduces the old in-place block verbatim (core 1 =
     * AD1CH5 Phase B; core 2 = AD2CH1 + A/C PINSEL mux). AK512: handle =
     * floating phase, dedicated channel, no runtime PINSEL. */
    uint8_t core = HAL_ADC_SelectBemfPhase(floatPhase);
    pData->hwzc.activeCore = core;

    /* Compute threshold with deadband (Rule 4).
     * Filter compensation (if enabled) shifts the threshold AWAY from neutral
     * in the direction OPPOSITE the deadband, so the comparator fires earlier
     * by an amount equal to the PCB RC filter's phase lag at this stepPeriodHR.
     * No-op when FEATURE_HWZC_FILTER_COMP=0. */
    uint16_t thresh = pData->bemf.zcThreshold;
    thresh = HWZC_ApplyFilterComp(pData, thresh, risingZc);
    if (risingZc)
        thresh = (thresh + HWZC_CMP_DEADBAND < 4095) ? thresh + HWZC_CMP_DEADBAND : 4095;
    else
        thresh = (thresh > HWZC_CMP_DEADBAND) ? thresh - HWZC_CMP_DEADBAND : 0;

    HAL_ADC_ConfigComparator(core, thresh, risingZc);

    /* Calculate blanking delay from step period.
     * In sector PI mode, use timerPeriod (the PI-controlled commutation
     * interval) as the basis so blanking scales with the actual closed-loop
     * period, not the IIR-tracked stepPeriodHR (which is paused in PI mode). */
#if FEATURE_HWZC_SECTOR_PI
    uint32_t periodForBlank = pData->hwzc.timerPeriod;
    if (periodForBlank < pData->hwzc.stepPeriodHR)
        periodForBlank = pData->hwzc.stepPeriodHR;   /* startup safety */
#else
    uint32_t periodForBlank = pData->hwzc.stepPeriodHR;
#endif
    uint32_t blankTicks = HWZC_BlankTicks(pData, periodForBlank);

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_BLANKING;

    HAL_SCCP1_StartOneShot(blankTicks);
}

/**
 * @brief Compute commDelay from current stepPeriodHR + advance schedule.
 * Pulled out so OnBlankingExpired can pre-compute (saving ~1.5µs in the
 * latency-critical OnZcDetected ISR). Uses stepPeriodHR (IIR-filtered), so
 * pre-computing during BLANKING gives the same result as computing in
 * OnZcDetected except for the most-recent IIR update (~25% influence from
 * the just-measured interval). Acceptable tradeoff for latency.
 */
static inline uint32_t ComputeCommDelay(uint32_t stepPeriodHR,
                                        volatile uint16_t *dbgAdvanceDegOut)
{
    uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
    uint32_t eRPM = HWZC_TICKS_TO_ERPM(stepPeriodHR);
    uint16_t advDeg;
    if (eRPM <= RT_RAMP_TARGET_ERPM)
        advDeg = TIMING_ADVANCE_MIN_DEG;
    else if (eRPM >= RT_TIMING_ADV_FULL_ERPM)
        advDeg = RT_TIMING_ADV_MAX_DEG;
    else
    {
        uint32_t range = RT_TIMING_ADV_FULL_ERPM - RT_RAMP_TARGET_ERPM;
        uint32_t pos = eRPM - RT_RAMP_TARGET_ERPM;
        advDeg = TIMING_ADVANCE_MIN_DEG +
            (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                       * pos / range);
    }
    commDelay = stepPeriodHR * (30 - advDeg) / 60;
    if (dbgAdvanceDegOut) *dbgAdvanceDegOut = advDeg;
#else
    commDelay = stepPeriodHR / 2;
    (void)dbgAdvanceDegOut;
#endif
    if (commDelay < 10) commDelay = 10;
    return commDelay;
}

/**
 * @brief Blanking period expired — enable comparator and start timeout timer.
 * Called from SCCP1 ISR when phase == HWZC_BLANKING.
 */
void HWZC_OnBlankingExpired(volatile GARUDA_DATA_T *pData)
{
#if !HWZC_USE_SW_COMPARE
    uint8_t core = pData->hwzc.activeCore;

#if FEATURE_HWZC_FALLING_SW
    /* Hybrid per-polarity: arm the HW comparator ONLY for rising sectors.
     * Falling sectors are detected via the OFF-center SW compare in the ADC ISR
     * (the HW comparator is silent on falling at speed). Leaving its IE off for
     * falling avoids phantom ON-time fires competing with the SW capture. */
    if (commutationTable[pData->currentStep].zcPolarity > 0)
    {
        HAL_ADC_ClearComparatorFlag(core);
        HAL_ADC_EnableComparatorIE(core);
    }
#else
    /* Clear any stale comparator events, then enable interrupt */
    HAL_ADC_ClearComparatorFlag(core);
    HAL_ADC_EnableComparatorIE(core);
#endif
#else
    /* SW compare mode: leave the HW digital comparator IE disabled.
     * ZC detection runs in the 24 kHz ADC ISR via HWZC_OnSoftwareSample(). */
#endif

#if FEATURE_HWZC_SECTOR_PI
    /* Sector PI mode: schedule SCCP1 to fire at the autonomous commutation
     * deadline (lastCommStamp + timerPeriod). ZC events that arrive between
     * now and that deadline just timestamp lastCaptureHR; the PI math runs
     * in HWZC_OnPiPeriodExpired (dispatched from _CCT1Interrupt at phase
     * WATCHING when in PI mode). No separate timeout — a missed ZC is
     * absorbed by the PI as a non-update (timerPeriod unchanged). */
    uint32_t blankTicks = HWZC_BlankTicks(pData, pData->hwzc.timerPeriod);
    uint32_t remaining = (pData->hwzc.timerPeriod > blankTicks)
                         ? (pData->hwzc.timerPeriod - blankTicks)
                         : 100;
    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_WATCHING;
    HAL_SCCP1_StartOneShot(remaining);
#else
    /* Reactive mode: SCCP1 fires as a timeout (no ZC) at 2× stepPeriodHR.
     * On real ZC, OnZcDetected restarts SCCP1 with commDelay for the
     * commutation phase. */
    uint32_t timeoutTicks = pData->hwzc.stepPeriodHR * 2;

    /* Pre-compute commDelay so the latency-critical OnZcDetected ISR can
     * skip the ~1.5µs of division/interpolation. Result is essentially the
     * same — OnZcDetected would only see a slightly different stepPeriodHR
     * after one more IIR update (25% influence). At 100k eRPM that's ~1°
     * of advance equivalent recovered. */
    pData->hwzc.cachedCommDelay = ComputeCommDelay(pData->hwzc.stepPeriodHR,
                                                    &pData->hwzc.dbgAdvanceDeg);

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_WATCHING;

