bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    HAL_SCCP1_StartOneShot(timeoutTicks);
#endif
}

/**
 * @brief ZC detected by ADC comparator.
 * Comparator IE already disabled and CMPSTAT cleared by ISR stub.
 * Records timestamp, updates step period via seqlock, schedules commutation.
 */
void HWZC_OnZcDetected(volatile GARUDA_DATA_T *pData)
{
    /* Off-time gate (PWMxH-LOW rejection) was REMOVED (2026-04-20).
     *
     * The gate added up to ~42 µs of detection latency (one full PWM cycle
     * at 24 kHz) when a real ZC happened to cross the threshold during
     * PWM OFF-time. At 118 k eRPM (sector = 85 µs) that's ~50 % of a
     * sector — the 22° TIMING_ADVANCE_MAX_DEG couldn't compensate it, and
     * the motor topped out around 88 k instead of the 118 k milestone
     * recorded at commit 868b2ff.
     *
     * The plausibility gate below (reject interval < 70 % of stepPeriodHR)
     * is sufficient alone for phantom rejection — it was what the 118 k
     * run used, and phantoms whose spacing happens to land above 70 % of
     * the expected sector are rare enough that the IIR absorbs them.
     */
    uint32_t zcStamp = HAL_SCCP2_ReadTimestamp();

    /* First ZC after HWZC_Enable: bypass plausibility gate AND skip IIR.
     * The seeded lastZcStamp is a half-step guess based on where morph exit
     * happened to fall in the rotor cycle. The first measured interval is
     * therefore rotor-position-dependent and not representative — it can be
     * anywhere from 10% to 190% of a real step period. Accepting it blindly
     * risks (a) false reject by plausibility gate → timeout cascade → HWZC
     * disable → stall, or (b) IIR getting dragged off stepPeriodHR. Just
     * anchor lastZcStamp; the SECOND ZC gives a clean, full-step interval. */
    if (pData->hwzc.firstZcAfterEnable)
    {
        pData->hwzc.firstZcAfterEnable = false;
#if FEATURE_HWZC_SECTOR_PI
        /* PI mode: don't reschedule SCCP1 — the autonomous period timer
         * set up in OnBlankingExpired stays active. Just timestamp this
         * first capture so the next OnPiPeriodExpired can compute capValue
         * against prevCommHR. */
        pData->hwzc.lastCaptureHR = zcStamp;
        pData->hwzc.captureValid  = true;
        pData->hwzc.lastZcStamp   = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;
        HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);
        /* phase stays WATCHING; SCCP1 already armed for end-of-period */
        return;
#else
        HAL_SCCP1_Stop();
        pData->hwzc.lastZcStamp = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;

        /* First ZC: use freshly computed commDelay since OnBlankingExpired's
         * cached value reflects the seeded stepPeriodHR which is correct here.
         * (One inline call to ComputeCommDelay — couldn't pre-compute yet.) */
        uint32_t commDelay = ComputeCommDelay(pData->hwzc.stepPeriodHR,
                                              &pData->hwzc.dbgAdvanceDeg);
        /* Gate comparator OFF during COMM_PENDING — see comment in main path */
        HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);
        pData->hwzc.phase = HWZC_COMM_PENDING;
        HAL_SCCP1_StartOneShot(commDelay);
        return;
#endif
    }

#if FEATURE_HWZC_FALLING_HW && FEATURE_HWZC_FREEWHEEL_GATE
    /* Per-polarity FREEWHEEL gate (U3 falling-via-HW-comparator, 2026-06-26).
     * A RISING ZC is detectable during PWM-ON (driven-phase coupling assists the
     * upward crossing); a FALLING ZC is only clean during PWM-OFF (freewheel) —
     * during PWM-ON the driven phases couple the floating phase UP and bury the
     * downward crossing (bench 2026-06-07). So accept the comparator capture
     * ONLY in the correct window for this sector's polarity:
     *   rising  -> accept while PWM ON
     *   falling -> accept while PWM OFF (freewheel)
     * The freewheel window always exists around the trough at ANY duty <100%,
     * and the 1 MHz free-running ADC gets several conversions inside it, so the
     * comparator finds the true falling crossing at any duty — without the fixed
     * MPER/2 sample's 50%-duty wall. Read the H-side GPIO of the PWMing phase
     * (complementary mode: H HIGH = PWM ON). */
    {
        const COMMUTATION_STEP_T *fcs = &commutationTable[pData->currentStep];
        bool pwmOn;
        if      (fcs->phaseA == PHASE_PWM_ACTIVE) pwmOn = (PORTD & (1u << 2)) != 0; /* RD2 = PWM1H */
        else if (fcs->phaseB == PHASE_PWM_ACTIVE) pwmOn = (PORTD & (1u << 0)) != 0; /* RD0 = PWM2H */
        else                                      pwmOn = (PORTC & (1u << 3)) != 0; /* RC3 = PWM3H */
        bool wantOn = (fcs->zcPolarity > 0);   /* rising->PWM-ON, falling->PWM-OFF */
        if (pwmOn != wantOn) {
            pData->hwzc.noiseRejectCount++;
            pData->hwzc.rejectsThisStep++;
            uint8_t fc = pData->hwzc.activeCore;
            HAL_ADC_ClearComparatorFlag(fc);
            HAL_ADC_EnableComparatorIE(fc);
            return;
        }
    }
#endif

#if FEATURE_HWZC_PWM_GATE
    /* PWM-state gate: reject captures during PWM OFF time. At BEMF crossover
     * (Vapp ≈ Vbemf), the comparator fires on different signal regimes in
     * ON vs OFF windows — ON-time crossings around motor neutral (duty×Vbus/2),
     * OFF-time pseudo-crossings around 0V (all driven phases grounded, only
     * BEMF on floating phase). PI ingesting both produces ambiguous rotor
     * angle estimates → occasional 60° slip → 22A phase spike → UV cascade.
     *
     * Reads the H-side GPIO of the currently PWMing phase. In complementary
     * mode, H-side HIGH = PWM ON, H-side LOW = PWM OFF. Worst-case latency
     * at 45 kHz × 79% duty = 4.6 µs OFF time ≈ 3° at 200k eRPM. */
    {
        const COMMUTATION_STEP_T *cs = &commutationTable[pData->currentStep];
        bool pwmOn;
        if      (cs->phaseA == PHASE_PWM_ACTIVE) pwmOn = (PORTD & (1u << 2)) != 0; /* RD2 = PWM1H */
        else if (cs->phaseB == PHASE_PWM_ACTIVE) pwmOn = (PORTD & (1u << 0)) != 0; /* RD0 = PWM2H */
        else                                     pwmOn = (PORTC & (1u << 3)) != 0; /* RC3 = PWM3H */
        if (!pwmOn) {
            pData->hwzc.noiseRejectCount++;
            pData->hwzc.rejectsThisStep++;
            uint8_t core = pData->hwzc.activeCore;
            HAL_ADC_ClearComparatorFlag(core);
            HAL_ADC_EnableComparatorIE(core);
            return;
        }
    }
#endif

    /* Chop gate: the SW OC limiter cut duty within the last 2 PWM cycles -
     * the applied-voltage step corrupts the BEMF crossing in this window
     * exactly like a PWM-OFF capture. Reject; the period fallback carries
     * missed captures (bench: 60% single-polarity misses survivable), a
     * false capture here is a 60-degree slip (scope run 18 @18A). */
    if (pData->hwzc.chopBlank)
    {
        pData->hwzc.noiseRejectCount++;
        pData->hwzc.rejectsThisStep++;
        uint8_t core = pData->hwzc.activeCore;
        HAL_ADC_ClearComparatorFlag(core);
        HAL_ADC_EnableComparatorIE(core);
        return;
    }

    /* INTERVAL CHECK FIRST (cheap, ~500 ns) — reorder C: kills early-arriving
     * noise before spending 3 µs on verify reads. Most PWM-ripple-driven
     * comparator re-fires happen within microseconds of the last accept,
     * so this catches them before the verify loop runs. */
    uint32_t interval = zcStamp - pData->hwzc.lastZcStamp;
    uint32_t minInterval = pData->hwzc.stepPeriodHR
                           * HWZC_MIN_INTERVAL_PCT / 100;
    if (minInterval < RT_HWZC_MIN_STEP_TICKS)
        minInterval = RT_HWZC_MIN_STEP_TICKS;

    if (interval < minInterval)
    {
        /* Noise — re-arm comparator, keep timeout running */
        pData->hwzc.noiseRejectCount++;
        pData->hwzc.rejectsThisStep++;
        uint8_t core = pData->hwzc.activeCore;
        HAL_ADC_ClearComparatorFlag(core);
        HAL_ADC_EnableComparatorIE(core);
        return;
    }

#if FEATURE_HWZC_VERIFY_READS
    /* Signal-coherence verification (post-203k restructure 2026-05-26):
     * The comparator-trigger ADC sample already passed the threshold (else the
     * IRQ wouldn't have fired) — re-reading AD1CH5DATA immediately would just
     * see that same sample. Useful verification requires WAITING for the next
     * ADC conversion (SCCP3 = 1 MHz → ~1 µs cadence) then reading a fresh
     * value. A real BEMF crossing stays on the crossed side; a phantom driven
     * by PWM ripple flips back within one sample period.
     *
     * Order matters: wait FIRST, then read. With HWZC_VERIFY_READS=1 we make
     * exactly one meaningful verification at ~1 µs cost (~7° at 200k). With
     * N>1 each additional iteration adds another 1 µs and one more read.
     *
     * Active across the full RPM range — HWZC_VERIFY_SKIP_ERPM=999999 keeps
     * this loop enabled at high RPM where it's most needed (PWM ripple at the
     * BEMF passband becomes harder to distinguish from real crossings). */
    if (pData->hwzc.stepPeriodHR > HWZC_VERIFY_SKIP_TICKS) {
        uint8_t v_core = pData->hwzc.activeCore;
        int8_t  v_pol  = commutationTable[pData->currentStep].zcPolarity;
        bool    v_rising = (v_pol > 0);
        uint16_t v_thresh = pData->bemf.zcThreshold;
        if (v_rising)
            v_thresh = (v_thresh + HWZC_CMP_DEADBAND < 4095)
                       ? v_thresh + HWZC_CMP_DEADBAND : 4095;
        else
            v_thresh = (v_thresh > HWZC_CMP_DEADBAND)
                       ? v_thresh - HWZC_CMP_DEADBAND : 0;

