bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    /* advancePlus30Fp8 = (30 + advDeg) × 256 / 60. Max value at advDeg=30 is 256;
     * at advDeg=0 is 128. Fits comfortably in uint16. */
    uint16_t advFp8 = (uint16_t)(((30u + (uint32_t)advDeg) * 256u) / 60u);

#if FEATURE_HWZC_PI_DEFENSIVE
    /* Track whether THIS event has a capture (BEFORE the gate below
     * consumes captureValid). Used by the defensive-mode streak counters
     * regardless of whether the capture passes the 0<cap<T range check.
     * A rejected capture (cap > T) is NOT silence — only "captureValid==
     * false at entry" counts toward the defensive trigger. */
    bool hadCaptureThisEvent = pData->hwzc.captureValid;
    if (!hadCaptureThisEvent)
        pData->hwzc.dbgPiNoCap++;        /* bring-up diag: silent PI event */
#endif

    /* Run PI if we have a fresh capture from this sector */
    if (pData->hwzc.captureValid) {
        /* capValue = elapsed HR ticks FROM THE START OF THIS SECTOR (i.e. the
         * most recent commutation = lastCommStamp) TO the captured ZC.
         *
         * Timing: OnPiPeriodExpired fires BEFORE OnCommutation runs. So at
         * this moment, lastCommStamp still holds T_N (start of the sector
         * that's ending), and lastCaptureHR ≈ T_N + T/2 (ZC at midpoint).
         * After PI math, OnCommutation shifts prevCommHR ← lastCommStamp
         * and lastCommStamp ← now. Modular subtraction handles SCCP2 wrap
         * (every ~42 s at 100 MHz). */
        uint32_t capValue = pData->hwzc.lastCaptureHR - pData->hwzc.lastCommStamp;
        uint32_t setValue = ((uint32_t)advFp8 * T) >> 8;

        /* bring-up diag: capture position in sector, even if rejected —
         * split by ZC polarity (even sectors 0/2/4 = rising comparator path,
         * odd 1/3/5 = falling RC-filtered SW path). */
        if (T > 0) {
            uint16_t pm = (uint16_t)(((uint64_t)capValue * 1000u) / T);
            if (pData->currentStep & 1)
                pData->hwzc.dbgPiCrossSector = pm;   /* falling-sector cap */
            else
                pData->hwzc.dbgLastCapPm = pm;       /* rising-sector cap */
        }

        /* Cross-sector reject (same gate in both float and int paths). */
        if (capValue > T) {
            pData->hwzc.dbgPiMissCount++;
            pData->hwzc.captureValid = false;
            goto pi_commutate;
        }

        int32_t delta = (int32_t)capValue - (int32_t)setValue;

        /* Per-capture delta clamp — ASYMMETRIC at high RPM. */
        int32_t posDeltaCap, negDeltaCap;
        if (T < HWZC_PI_CLAMP_HIGH_TICKS) {
            posDeltaCap = (int32_t)(T >> HWZC_PI_DELTA_CLAMP_SHIFT_HIGH);
            negDeltaCap = (int32_t)(T >> HWZC_PI_NEG_DELTA_CLAMP_SHIFT_HIGH);
        } else {
            posDeltaCap = (int32_t)(T >> HWZC_PI_DELTA_CLAMP_SHIFT);
            negDeltaCap = posDeltaCap;
        }
#if FEATURE_HWZC_HANDOFF_DAMP
        /* Hand-off damp: during the first window after CL entry, hard-limit how
         * much a single capture can SHRINK the period (negative delta only), so a
         * too-early first capture can't collapse to the half-period phantom. Legit
         * acceleration is gradual and proceeds at the damped rate; the runaway is
         * blocked. negative delta = capture earlier than setpoint = period shrink. */
        if (pData->hwzc.handoffDamp > 0) {
            pData->hwzc.handoffDamp--;
            int32_t damped = (int32_t)(T >> HWZC_HANDOFF_NEG_SHIFT);
            if (damped < 1) damped = 1;
            if (negDeltaCap > damped) negDeltaCap = damped;
        }
#endif
        if (delta >  posDeltaCap) delta =  posDeltaCap;
        if (delta < -negDeltaCap) delta = -negDeltaCap;
        pData->hwzc.dbgPiDelta = (int16_t)(delta > 32767 ? 32767
                                          : delta < -32768 ? -32768
                                          : delta);

#if FEATURE_HWZC_PI_FLOAT
        /* --- FLOAT PI (Phase 1) --- */
        float deltaF = (float)delta;
        (void)T;

  #if FEATURE_HWZC_PI_DEFENSIVE
        /* In defensive mode, ignore the capture's delta — captures during
         * a silence-recovery window can be misleading. The slow-down
         * logic below the if/else block walks T larger. */
        if (!pData->hwzc.piDefActive) {
  #endif
            pData->hwzc.integratorF += HWZC_PI_KI_FLOAT * deltaF;
            if (pData->hwzc.integratorF < (float)RT_HWZC_MIN_STEP_TICKS)
                pData->hwzc.integratorF = (float)RT_HWZC_MIN_STEP_TICKS;

            float newPerF = pData->hwzc.integratorF + HWZC_PI_KP_FLOAT * deltaF;
            if (newPerF < (float)RT_HWZC_MIN_STEP_TICKS)
                newPerF = (float)RT_HWZC_MIN_STEP_TICKS;

            pData->hwzc.timerPeriod = (uint32_t)newPerF;
            pData->hwzc.integrator  = (uint32_t)pData->hwzc.integratorF;
  #if FEATURE_HWZC_PI_DEFENSIVE
        }
  #endif
#else
        /* --- ORIGINAL INTEGER BIT-SHIFT PI --- */
        /* Integrator update — slow drift correction. */
        int32_t newInt = (int32_t)pData->hwzc.integrator + (delta >> HWZC_PI_KI_SHIFT);
        if (newInt < (int32_t)RT_HWZC_MIN_STEP_TICKS)
            newInt = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        if (newInt < 0) newInt = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.integrator = (uint32_t)newInt;

        /* Period update — fast dynamics. */
        int32_t newPer = (int32_t)pData->hwzc.integrator + (delta >> HWZC_PI_KP_SHIFT);
        if (newPer < (int32_t)RT_HWZC_MIN_STEP_TICKS)
            newPer = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        if (newPer < 0) newPer = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.timerPeriod = (uint32_t)newPer;
#endif /* FEATURE_HWZC_PI_FLOAT */

#if FEATURE_HWZC_ABS_FLOOR
        /* Absolute operating-point floor — block the harmonic false-lock that
         * the relative gates can't (cumulative ratchet → phantom). The rotor
         * cannot spin faster than the no-load physics for the present duty/Vbus,
         * so the commanded period cannot be shorter than P_ff/(overspeed margin).
         * Reuses the FF-seed no-load-period formula (see HWZC_Enable). */
        {
            float dutyFrac = (float)pData->duty / (float)LOOPTIME_TCY;
            float vbus_v   = (float)pData->vbusRaw * VBUS_SCALE_V_PER_COUNT;
            float lambdaPm = (float)gspParams.focKeUvSRad;
            if (dutyFrac > HWZC_ABS_FLOOR_MIN_DUTYFRAC && vbus_v > 6.0f
                && lambdaPm > 0.0f) {
                float P_ff = (181.380f * lambdaPm) / (vbus_v * dutyFrac);
                /* Duty-tiered overspeed ceiling: tight at idle/low duty (no
                 * advance -> rotor can't exceed ~no-load, so a fast-chop phantom
                 * at ~140% is clamped to ~no-load and the loop coasts to true
                 * idle), loose at high duty where advance legitimately overspeeds. */
                float overPct = (dutyFrac < HWZC_ABS_FLOOR_LOW_DUTYFRAC)
                    ? (float)HWZC_ABS_FLOOR_OVERSPEED_PCT_LOW
                    : (float)HWZC_ABS_FLOOR_OVERSPEED_PCT;
                uint32_t floorP = (uint32_t)(P_ff * (100.0f / overPct));
                /* SHRINK-ONLY: clamp only when the PI is DRIVING the period
                 * below the floor (commutating FASTER — the phantom). A period
                 * already below the floor but GROWING (T_new > T_entry) is a
                 * legitimate high-speed decel coasting down through the floor —
                 * the rotor really is that fast — so let it track. The rotor
                 * cannot ACCELERATE at idle duty, so a shrink below floor is
                 * provably a false-lock. */
                if (pData->hwzc.timerPeriod < floorP
                    && pData->hwzc.timerPeriod < T) {
                    pData->hwzc.timerPeriod = floorP;
  #if FEATURE_HWZC_PI_FLOAT
                    if (pData->hwzc.integratorF < (float)floorP)
                        pData->hwzc.integratorF = (float)floorP;
  #endif
                    if (pData->hwzc.integrator < floorP)
                        pData->hwzc.integrator = floorP;
                }
            }
        }
#endif

        /* Mirror to stepPeriodHR so eRPM telemetry (and the reactive
         * path's diagnostics) reflect the PI-controlled rotor period. */
        pData->hwzc.writeSeq++;
        pData->hwzc.stepPeriodHR = pData->hwzc.timerPeriod;
        pData->hwzc.writeSeq++;

        pData->hwzc.captureValid = false;
        pData->hwzc.dbgPiCaptureCount++;
        {
            uint8_t s = pData->currentStep;
            if (s < 6) pData->hwzc.dbgPiCapBySector[s]++;
        }
        if (pData->hwzc.goodZcCount < 0xFFFE) /* keep goodZc growing for telem */
            pData->hwzc.goodZcCount++;
    } else {
        /* No capture this sector — period unchanged. Robust by design.
         * Track which sector is missing so we can confirm AD1 vs AD2 split. */
        pData->hwzc.dbgPiMissCount++;
        pData->hwzc.missCount++;
        pData->hwzc.totalMissCount++;
        {
            uint8_t s = pData->currentStep;
            if (s < 6) pData->hwzc.dbgPiMissBySector[s]++;
        }
    }

#if FEATURE_HWZC_PI_DEFENSIVE
    /* --- DEFENSIVE PI streak tracking + slow-down ---
     * Only true silence (no capture event at all) counts toward the
     * defensive trigger. A capture that arrived but was rejected by the
     * range gate (cap > T) is NOT silence — those are transient
     * mismatches the PI handles normally. */
    if (hadCaptureThisEvent) {
        pData->hwzc.piDefMissStreak = 0;
        if (pData->hwzc.piDefGoodStreak < 0xFFFF)
            pData->hwzc.piDefGoodStreak++;
    } else {
        if (pData->hwzc.piDefMissStreak < 0xFFFF)
            pData->hwzc.piDefMissStreak++;
        pData->hwzc.piDefGoodStreak = 0;
    }

