bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
        uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
        {
            uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
            uint16_t advDeg;
            if (eRPM <= RT_RAMP_TARGET_ERPM)
                advDeg = TIMING_ADVANCE_MIN_DEG;
            else if (eRPM >= RT_TIMING_ADV_FULL_ERPM)
                advDeg = RT_TIMING_ADV_MAX_DEG;
            else {
                uint32_t range = RT_TIMING_ADV_FULL_ERPM - RT_RAMP_TARGET_ERPM;
                uint32_t pos   = eRPM - RT_RAMP_TARGET_ERPM;
                advDeg = TIMING_ADVANCE_MIN_DEG +
                    (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                               * pos / range);
            }
            commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
            pData->hwzc.dbgAdvanceDeg = advDeg;
        }
#else
        commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
        if (commDelay < 10) commDelay = 10;
        pData->hwzc.phase = HWZC_COMM_PENDING;
        HAL_SCCP1_StartOneShot(commDelay);
        return;
    }

    /* Plausibility gate: reject intervals shorter than 70% of stepPeriodHR,
     * with RT_HWZC_MIN_STEP_TICKS as hard floor (physical max eRPM). */
    uint32_t interval = zcStamp - pData->hwzc.lastZcStamp;
    uint32_t minInterval = pData->hwzc.stepPeriodHR
                           * HWZC_MIN_INTERVAL_PCT / 100;
    if (minInterval < RT_HWZC_MIN_STEP_TICKS)
        minInterval = RT_HWZC_MIN_STEP_TICKS;

    if (interval < minInterval) {
        pData->hwzc.noiseRejectCount++;
        pData->hwzc.rejectsThisStep++;
        return;  /* stay in WATCHING; timeout still armed */
    }

    /* Cancel timeout */
    HAL_SCCP1_Stop();

    /* Update IIR: see HWZC_OnZcDetected for the freeze-first-N rationale. */
    if (pData->hwzc.stepsSinceLastHwZc == 1
        && pData->hwzc.goodZcCount >= HWZC_IIR_FREEZE_ZC_COUNT) {
        pData->hwzc.writeSeq++;
        uint32_t newPeriod = (3 * pData->hwzc.stepPeriodHR + interval) / 4;
        if (newPeriod < RT_HWZC_MIN_STEP_TICKS)
            newPeriod = RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.stepPeriodHR = newPeriod;
        pData->hwzc.writeSeq++;
    }
    pData->hwzc.stepsSinceLastHwZc = 0;
    pData->hwzc.lastZcStamp = zcStamp;

    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* Schedule commutation (same advance/delay math as HW path) */
    uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
    {
        uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
        uint16_t advDeg;
        if (eRPM <= RT_RAMP_TARGET_ERPM)
            advDeg = TIMING_ADVANCE_MIN_DEG;
        else if (eRPM >= RT_TIMING_ADV_FULL_ERPM)
            advDeg = RT_TIMING_ADV_MAX_DEG;
        else {
            uint32_t range = RT_TIMING_ADV_FULL_ERPM - RT_RAMP_TARGET_ERPM;
            uint32_t pos   = eRPM - RT_RAMP_TARGET_ERPM;
            advDeg = TIMING_ADVANCE_MIN_DEG +
                (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                           * pos / range);
        }
        commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
        pData->hwzc.dbgAdvanceDeg = advDeg;
    }
#else
    commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
    if (commDelay < 10) commDelay = 10;

    pData->hwzc.phase = HWZC_COMM_PENDING;
    HAL_SCCP1_StartOneShot(commDelay);
}
#endif /* HWZC_USE_SW_COMPARE */

#endif /* FEATURE_ADC_CMP_ZC */
